//Задание 1.Создание методов, которые производят вычисления с матрицами


//Что нужно сделать
//Напишите как минимум четыре метода.

//Первый метод умножает матрицу на число. Для этого он принимает в качестве параметров матрицу и число, на которое будет происходить умножение. В качестве результата этот метод возвращает новую матрицу, а исходная матрица остаётся неизменной.
//Второй метод производит сложение двух матриц. В качестве параметров он принимает две матрицы, а в качестве результата возвращает новую матрицу. Исходные матрицы в процессе выполнения метода не изменяются.
//Третий метод аналогичен предыдущему, только выполняется не сложение, а вычитание.
//Четвёртый метод выполняет перемножение двух матриц. В качестве параметров он принимает две матрицы, а в качестве результата возвращает новую матрицу. Исходные матрицы остаются неизменными.

using System;

namespace HW1
{
    class Program
    {
        static void Main(string[] args)
        {
            StartProgram newProgram = new StartProgram();
        }
    }
}
